In [228]:
import pandas as pd
import json
import numpy as np
from pandasql import sqldf
import statistics 
import math
import scipy as stats
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3
import datetime
from datetime import  date, datetime, timedelta

In [229]:
# connect to database
con = sqlite3.connect('/Users/kaylalocklear/Documents/tableau/archive/sqlite-sakila.db')

In [230]:
# sql query
df = pd.read_sql_query('''select film.title ,
payment.amount as payment_amount,film.title ,
customer.first_name || " " || customer.last_name as customer_name,
rental.rental_date ,rental.return_date  ,  film.replacement_cost ,
staff.first_name, staff.first_name || staff.last_name as staff_name,
city.city , country.country, store.store_id 
from rental
left join inventory on inventory.inventory_id  = rental.inventory_id 
left join film on film.film_id = inventory.film_id 
left join customer on customer.customer_id = rental.customer_id 
left join payment on payment.rental_id = rental.rental_id  
left join staff on staff.staff_id = rental.staff_id   
left join address on address.address_id = customer.address_id 
left join store on store.manager_staff_id = staff.staff_id 
left join city on city.city_id = address.city_id 
left join country on country.country_id = city.country_id
 ''',con)
df

,title,payment_amount,title,customer_name,rental_date,return_date,replacement_cost,first_name,staff_name,city,country,store_id
0,BLANKET BEVERLY,2.99,BLANKET BEVERLY,CHARLOTTE HUNTER,2005-05-24 22:53:30.000,2005-05-26 22:04:30.000,21.99,Mike,MikeHillyer,guas Lindas de Gois,Brazil,1
1,FREAKY POCUS,2.99,FREAKY POCUS,TOMMY COLLAZO,2005-05-24 22:54:33.000,2005-05-28 19:40:33.000,16.99,Mike,MikeHillyer,Qomsheh,Iran,1
2,GRADUATE LORD,3.99,GRADUATE LORD,MANUEL MURRELL,2005-05-24 23:03:39.000,2005-06-01 22:12:39.000,14.99,Mike,MikeHillyer,Jaffna,Sri Lanka,1
3,LOVE SUICIDES,4.99,LOVE SUICIDES,ANDREW PURDY,2005-05-24 23:04:41.000,2005-06-03 01:43:41.000,21.99,Jon,JonStephens,Baku,Azerbaijan,2
4,IDOLS SNATCHERS,6.99,IDOLS SNATCHERS,DELORES HANSEN,2005-05-24 23:05:21.000,2005-06-02 04:33:21.000,29.99,Mike,MikeHillyer,Jaroslavl,Russian Federation,1
...,...,...,...,...,...,...,...,...,...,...,...,...
16039,COMANCHEROS ENEMY,0.99,COMANCHEROS ENEMY,BETTY WHITE,2005-08-23 22:25:26.000,2005-08-25 23:54:26.000,23.99,Mike,MikeHillyer,Citrus Heights,United States,1
16040,VOYAGE LEGALLY,0.99,VOYAGE LEGALLY,DENISE KELLY,2005-08-23 22:26:47.000,2005-08-27 18:02:47.000,28.99,Jon,JonStephens,Rio Claro,Brazil,2
16041,ILLUSION AMELIE,0.99,ILLUSION AMELIE,GRACE ELLIS,2005-08-23 22:42:48.000,2005-08-25 02:48:48.000,15.99,Jon,JonStephens,Duisburg,Germany,2
16042,HUNCHBACK IMPOSSIBLE,8.99,HUNCHBACK IMPOSSIBLE,GLADYS HAMILTON,2005-08-23 22:43:07.000,2005-08-31 21:33:07.000,28.99,Mike,MikeHillyer,Ilorin,Nigeria,1
16043,MOB DUFFEL,3.99,MOB DUFFEL,PHILIP CAUSEY,2005-08-23 22:50:12.000,2005-08-30 01:01:12.000,25.99,Jon,JonStephens,Korolev,Russian Federation,2

In [231]:
# no duplicates
df.duplicated().sum()

0

In [232]:
# categorizing sales by rep - 4.2 is average for a sale 
df['col'] = df['payment_amount'].apply(lambda x: 'Above Avg' if x > 4.2
                                       else 'Avg' if x==4.2 else 'Below Avg'
                                       if x < 4.2 else 'No Sale')
    
df

# df['new column name'] = 
# df['column name'].apply(lambda x: 'value if condition is met' 
# if x condition else 'value if condition is not met')

,title,payment_amount,title,customer_name,rental_date,return_date,replacement_cost,first_name,staff_name,city,country,store_id,col
0,BLANKET BEVERLY,2.99,BLANKET BEVERLY,CHARLOTTE HUNTER,2005-05-24 22:53:30.000,2005-05-26 22:04:30.000,21.99,Mike,MikeHillyer,guas Lindas de Gois,Brazil,1,Below Avg
1,FREAKY POCUS,2.99,FREAKY POCUS,TOMMY COLLAZO,2005-05-24 22:54:33.000,2005-05-28 19:40:33.000,16.99,Mike,MikeHillyer,Qomsheh,Iran,1,Below Avg
2,GRADUATE LORD,3.99,GRADUATE LORD,MANUEL MURRELL,2005-05-24 23:03:39.000,2005-06-01 22:12:39.000,14.99,Mike,MikeHillyer,Jaffna,Sri Lanka,1,Below Avg
3,LOVE SUICIDES,4.99,LOVE SUICIDES,ANDREW PURDY,2005-05-24 23:04:41.000,2005-06-03 01:43:41.000,21.99,Jon,JonStephens,Baku,Azerbaijan,2,Above Avg
4,IDOLS SNATCHERS,6.99,IDOLS SNATCHERS,DELORES HANSEN,2005-05-24 23:05:21.000,2005-06-02 04:33:21.000,29.99,Mike,MikeHillyer,Jaroslavl,Russian Federation,1,Above Avg
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16039,COMANCHEROS ENEMY,0.99,COMANCHEROS ENEMY,BETTY WHITE,2005-08-23 22:25:26.000,2005-08-25 23:54:26.000,23.99,Mike,MikeHillyer,Citrus Heights,United States,1,Below Avg
16040,VOYAGE LEGALLY,0.99,VOYAGE LEGALLY,DENISE KELLY,2005-08-23 22:26:47.000,2005-08-27 18:02:47.000,28.99,Jon,JonStephens,Rio Claro,Brazil,2,Below Avg
16041,ILLUSION AMELIE,0.99,ILLUSION AMELIE,GRACE ELLIS,2005-08-23 22:42:48.000,2005-08-25 02:48:48.000,15.99,Jon,JonStephens,Duisburg,Germany,2,Below Avg
16042,HUNCHBACK IMPOSSIBLE,8.99,HUNCHBACK IMPOSSIBLE,GLADYS HAMILTON,2005-08-23 22:43:07.000,2005-08-31 21:33:07.000,28.99,Mike,MikeHillyer,Ilorin,Nigeria,1,Above Avg
16043,MOB DUFFEL,3.99,MOB DUFFEL,PHILIP CAUSEY,2005-08-23 22:50:12.000,2005-08-30 01:01:12.000,25.99,Jon,JonStephens,Korolev,Russian Federation,2,Below Avg

In [233]:
group = df.groupby(['staff_name','col'])['col'].count()
group.to_frame()

                        col
staff_name  col
JonStephens Above Avg  3886
            Below Avg  4118
MikeHillyer Above Avg  3860
            Below Avg  4180

In [234]:
df.head(50)

,title,payment_amount,title,customer_name,rental_date,return_date,replacement_cost,first_name,staff_name,city,country,store_id,col
0,BLANKET BEVERLY,2.99,BLANKET BEVERLY,CHARLOTTE HUNTER,2005-05-24 22:53:30.000,2005-05-26 22:04:30.000,21.99,Mike,MikeHillyer,guas Lindas de Gois,Brazil,1,Below Avg
1,FREAKY POCUS,2.99,FREAKY POCUS,TOMMY COLLAZO,2005-05-24 22:54:33.000,2005-05-28 19:40:33.000,16.99,Mike,MikeHillyer,Qomsheh,Iran,1,Below Avg
2,GRADUATE LORD,3.99,GRADUATE LORD,MANUEL MURRELL,2005-05-24 23:03:39.000,2005-06-01 22:12:39.000,14.99,Mike,MikeHillyer,Jaffna,Sri Lanka,1,Below Avg
3,LOVE SUICIDES,4.99,LOVE SUICIDES,ANDREW PURDY,2005-05-24 23:04:41.000,2005-06-03 01:43:41.000,21.99,Jon,JonStephens,Baku,Azerbaijan,2,Above Avg
4,IDOLS SNATCHERS,6.99,IDOLS SNATCHERS,DELORES HANSEN,2005-05-24 23:05:21.000,2005-06-02 04:33:21.000,29.99,Mike,MikeHillyer,Jaroslavl,Russian Federation,1,Above Avg
5,MYSTIC TRUMAN,0.99,MYSTIC TRUMAN,NELSON CHRISTENSON,2005-05-24 23:08:07.000,2005-05-27 01:32:07.000,19.99,Mike,MikeHillyer,Santiago de Compostela,Spain,1,Below Avg
6,SWARM GOLD,1.99,SWARM GOLD,CASSANDRA WALTERS,2005-05-24 23:11:53.000,2005-05-29 20:34:53.000,12.99,Jon,JonStephens,Salinas,United States,2,Below Avg
7,LAWLESS VISION,4.99,LAWLESS VISION,MINNIE ROMERO,2005-05-24 23:31:46.000,2005-05-27 23:33:46.000,29.99,Jon,JonStephens,Ciomas,Indonesia,2,Above Avg
8,MATRIX SNOWMAN,4.99,MATRIX SNOWMAN,ELLEN SIMPSON,2005-05-25 00:00:40.000,2005-05-28 00:22:40.000,9.99,Mike,MikeHillyer,Po,Brazil,1,Above Avg
9,HANGING DEEP,5.99,HANGING DEEP,DANNY ISOM,2005-05-25 00:02:21.000,2005-05-31 22:44:21.000,18.99,Jon,JonStephens,Okara,Pakistan,2,Above Avg
10,WHALE BIKINI,8.99,WHALE BIKINI,APRIL BURNS,2005-05-25 00:09:02.000,2005-06-02 20:56:02.000,11.99,Jon,JonStephens,Dundee,United Kingdom,2,Above Avg
11,GAMES BOWFINGER,4.99,GAMES BOWFINGER,DEANNA BYRD,2005-05-25 00:19:27.000,2005-05-30 05:44:27.000,17.99,Jon,JonStephens,Tuguegarao,Philippines,2,Above Avg
12,KING EVOLUTION,6.99,KING EVOLUTION,RAYMOND MCWHORTER,2005-05-25 00:22:55.000,2005-05-30 04:28:55.000,24.99,Mike,MikeHillyer,Sumqayit,Azerbaijan,1,Above Avg
13,MONTEREY LABYRINTH,0.99,MONTEREY LABYRINTH,THEODORE CULP,2005-05-25 00:31:15.000,2005-05-26 02:56:15.000,13.99,Mike,MikeHillyer,Uluberia,India,1,Below Avg
14,PELICAN COMFORTS,9.99,PELICAN COMFORTS,RONALD WEINER,2005-05-25 00:39:22.000,2005-06-03 03:30:22.000,17.99,Mike,MikeHillyer,San Felipe del Progreso,Mexico,1,Above Avg
15,BOOGIE AMELIE,4.99,BOOGIE AMELIE,STEVEN CURLEY,2005-05-25 00:43:11.000,2005-05-26 04:42:11.000,11.99,Jon,JonStephens,Miraj,India,2,Above Avg
16,CONTACT ANONYMOUS,2.99,CONTACT ANONYMOUS,ISAAC OGLESBY,2005-05-25 01:06:36.000,2005-05-27 00:43:36.000,10.99,Mike,MikeHillyer,Cuernavaca,Mexico,1,Below Avg
17,ROMAN PUNK,0.99,ROMAN PUNK,RUTH MARTINEZ,2005-05-25 01:10:47.000,2005-05-31 06:35:47.000,28.99,Jon,JonStephens,Kimberley,South Africa,2,Below Avg
18,HOLLOW JEOPARDY,4.99,HOLLOW JEOPARDY,RONNIE RICKETTS,2005-05-25 01:17:24.000,2005-05-31 06:00:24.000,25.99,Mike,MikeHillyer,Ziguinchor,Senegal,1,Above Avg
19,SCISSORHANDS SLUMS,2.99,SCISSORHANDS SLUMS,ROBERTA HARPER,2005-05-25 01:48:41.000,2005-05-27 02:20:41.000,13.99,Jon,JonStephens,Shahr-e Kord,Iran,2,Below Avg
20,APACHE DIVINE,4.99,APACHE DIVINE,CRAIG MORRELL,2005-05-25 01:59:46.000,2005-05-26 01:01:46.000,16.99,Jon,JonStephens,Cavite,Philippines,2,Above Avg
21,CLOSER BANG,4.99,CLOSER BANG,RAUL FORTIER,2005-05-25 02:19:23.000,2005-05-26 04:52:23.000,12.99,Jon,JonStephens,Chapra,India,2,Above Avg
22,WHALE BIKINI,4.99,WHALE BIKINI,BARRY LOVELACE,2005-05-25 02:40:21.000,2005-05-29 06:34:21.000,11.99,Mike,MikeHillyer,Kitwe,Zambia,1,Above Avg
23,REDS POCUS,4.99,REDS POCUS,JUAN FRALEY,2005-05-25 02:53:02.000,2005-05-27 01:15:02.000,23.99,Mike,MikeHillyer,Teboksary,Russian Federation,1,Above Avg
24,SUN CONFESSIONS,0.99,SUN CONFESSIONS,PAMELA BAKER,2005-05-25 03:21:20.000,2005-05-27 21:25:20.000,9.99,Jon,JonStephens,Nanyang,China,2,Below Avg
25,WAIT CIDER,3.99,WAIT CIDER,BILLY POULIN,2005-05-25 03:36:50.000,2005-05-31 00:34:50.000,9.99,Mike,MikeHillyer,Cabuyao,Philippines,1,Below Avg
26,EASY GLADIATOR,4.99,EASY GLADIATOR,ROBERT BAUGHMAN,2005-05-25 03:41:50.000,2005-05-30 01:13:50.000,12.99,Jon,JonStephens,Kaliningrad,Russian Federation,2,Above Avg
27,THIEF PELICAN,4.99,THIEF PELICAN,CONSTANCE REID,2005-05-25 03:42:37.000,2005-05-26 09:26:37.000,28.99,Jon,JonStephens,Zaria,Nigeria,2,Above Avg
28,CHAINSAW UPTOWN,0.99,CHAINSAW UPTOWN,MARIE TURNER,2005-05-25 03:47:12.000,2005-05-30 00:31:12.000,25.99,Jon,JonStephens,Lipetsk,Russian Federation,2,Below Avg
29,SONG HEDWIG,2.99,SONG HEDWIG,RAY HOULE,2005-05-25 04:01:32.000,2005-05-30 03:12:32.000,29.99,Mike,MikeHillyer,Dzerzinsk,Russian Federation,1,Below Avg
30,WITCHES PANIC,4.99,WITCHES PANIC,FRED WHEAT,2005-05-25 04:05:17.000,2005-05-30 07:15:17.000,10.99,Mike,MikeHillyer,Jurez,Mexico,1,Above Avg
31,STALLION SUNDANCE,0.99,STALLION SUNDANCE,JOY GEORGE,2005-05-25 04:06:21.000,2005-05-25 23:55:21.000,23.99,Mike,MikeHillyer,Botosani,Romania,1,Below Avg
32,GOLDMINE TYCOON,0.99,GOLDMINE TYCOON,KAY CALDWELL,2005-05-25 04:18:51.000,2005-05-27 03:58:51.000,20.99,Mike,MikeHillyer,Yantai,China,1,Below Avg
33,MICROCOSMOS PARADISE,2.99,MICROCOSMOS PARADISE,FREDDIE DUGGAN,2005-05-25 04:19:28.000,2005-05-29 00:10:28.000,22.99,Jon,JonStephens,Sullana,Peru,2,Below Avg
34,ENEMY ODDS,4.99,ENEMY ODDS,ROBERTO VU,2005-05-25 04:24:36.000,2005-05-27 07:02:36.000,23.99,Jon,JonStephens,Yinchuan,China,2,Above Avg
35,ESCAPE METROPOLIS,2.99,ESCAPE METROPOLIS,BONNIE HUGHES,2005-05-25 04:36:26.000,2005-05-29 00:31:26.000,20.99,Mike,MikeHillyer,Cheju,South Korea,1,Below Avg
36,BORROWERS BEDAZZLED,0.99,BORROWERS BEDAZZLED,JAVIER ELROD,2005-05-25 04:44:31.000,2005-05-29 01:03:31.000,22.99,Mike,MikeHillyer,NDjamna,Chad,1,Below Avg
37,MANCHURIAN CURTAIN,4.99,MANCHURIAN CURTAIN,MICHAEL SILVERMAN,2005-05-25 04:47:44.000,2005-06-01 00:58:44.000,27.99,Mike,MikeHillyer,Tiefa,China,1,Above Avg
38,WIND PHANTOM,0.99,WIND PHANTOM,GERTRUDE CASTILLO,2005-05-25 04:51:46.000,2005-05-31 03:14:46.000,12.99,Jon,JonStephens,Nuuk,Greenland,2,Below Avg
39,MINDS TRUMAN,4.99,MINDS TRUMAN,MARVIN YEE,2005-05-25 05:09:04.000,2005-05-27 23:12:04.000,22.99,Mike,MikeHillyer,Berhampore (Baharampur),India,1,Above Avg
40,GRIT CLOCKWORK,5.99,GRIT CLOCKWORK,YVONNE WATKINS,2005-05-25 05:12:29.000,2005-06-02 00:28:29.000,21.99,Mike,MikeHillyer,Ocumare del Tuy,Venezuela,1,Above Avg
41,BOILED DARES,4.99,BOILED DARES,HARVEY GUAJARDO,2005-05-25 05:24:58.000,2005-05-31 02:47:58.000,13.99,Jon,JonStephens,Vinh,Vietnam,2,Above Avg
42,MASSAGE IMAGE,2.99,MASSAGE IMAGE,NEIL RENNER,2005-05-25 05:39:25.000,2005-05-26 06:54:25.000,11.99,Jon,JonStephens,Cam Ranh,Vietnam,2,Below Avg
43,PIRATES ROXANNE,0.99,PIRATES ROXANNE,GERTRUDE CASTILLO,2005-05-25 05:53:23.000,2005-05-29 10:56:23.000,20.99,Jon,JonStephens,Nuuk,Greenland,2,Below Avg
44,HARRY IDAHO,7.99,HARRY IDAHO,TROY QUIGLEY,2005-05-25 05:59:39.000,2005-06-02 09:56:39.000,18.99,Jon,JonStephens,Vancouver,Canada,2,Above Avg
45,RIDGEMONT SUBMARINE,5.99,RIDGEMONT SUBMARINE,MARIA MILLER,2005-05-25 06:04:08.000,2005-06-02 08:18:08.000,28.99,Jon,JonStephens,Kragujevac,Yugoslavia,2,Above Avg
46,JAWS HARRY,3.99,JAWS HARRY,VIRGINIA GREEN,2005-05-25 06:05:20.000,2005-05-30 03:04:20.000,10.99,Mike,MikeHillyer,Toulouse,France,1,Below Avg
47,GUN BONNIE,1.99,GUN BONNIE,JENNY CASTRO,2005-05-25 06:20:46.000,2005-06-02 05:42:46.000,27.99,Mike,MikeHillyer,Ponce,Puerto Rico,1,Below Avg
48,PACIFIC AMISTAD,2.99,PACIFIC AMISTAD,GENE SANBORN,2005-05-25 06:39:35.000,2005-05-30 10:12:35.000,27.99,Jon,JonStephens,Salala,Oman,2,Below Avg
49,HOPE TOOTSIE,2.99,HOPE TOOTSIE,CAROL GARCIA,2005-05-25 06:44:53.000,2005-05-28 11:28:53.000,22.99,Jon,JonStephens,Kaduna,Nigeria,2,Below Avg

In [235]:
df['payment_amount'].mean()

4.201356270256309

In [236]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16044 entries, 0 to 16043
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   title             16044 non-null  object
 1   payment_amount    16044 non-null  float64
 2   title             16044 non-null  object
 3   customer_name     16044 non-null  object
 4   rental_date       16044 non-null  object
 5   return_date       15861 non-null  object
 6   replacement_cost  16044 non-null  float64
 7   first_name        16044 non-null  object
 8   staff_name        16044 non-null  object
 9   city              16044 non-null  object
 10  country           16044 non-null  object
 11  store_id          16044 non-null  int64
 12  col               16044 non-null  object
dtypes: float64(2), int64(1), object(10)
memory usage: 1.6+ MB

In [237]:
df['USA'] = df['country'].apply(lambda x: 'USA' if x == 'United States'
                                       else 'Other')
    
df

,title,payment_amount,title,customer_name,rental_date,return_date,replacement_cost,first_name,staff_name,city,country,store_id,col,USA
0,BLANKET BEVERLY,2.99,BLANKET BEVERLY,CHARLOTTE HUNTER,2005-05-24 22:53:30.000,2005-05-26 22:04:30.000,21.99,Mike,MikeHillyer,guas Lindas de Gois,Brazil,1,Below Avg,Other
1,FREAKY POCUS,2.99,FREAKY POCUS,TOMMY COLLAZO,2005-05-24 22:54:33.000,2005-05-28 19:40:33.000,16.99,Mike,MikeHillyer,Qomsheh,Iran,1,Below Avg,Other
2,GRADUATE LORD,3.99,GRADUATE LORD,MANUEL MURRELL,2005-05-24 23:03:39.000,2005-06-01 22:12:39.000,14.99,Mike,MikeHillyer,Jaffna,Sri Lanka,1,Below Avg,Other
3,LOVE SUICIDES,4.99,LOVE SUICIDES,ANDREW PURDY,2005-05-24 23:04:41.000,2005-06-03 01:43:41.000,21.99,Jon,JonStephens,Baku,Azerbaijan,2,Above Avg,Other
4,IDOLS SNATCHERS,6.99,IDOLS SNATCHERS,DELORES HANSEN,2005-05-24 23:05:21.000,2005-06-02 04:33:21.000,29.99,Mike,MikeHillyer,Jaroslavl,Russian Federation,1,Above Avg,Other
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16039,COMANCHEROS ENEMY,0.99,COMANCHEROS ENEMY,BETTY WHITE,2005-08-23 22:25:26.000,2005-08-25 23:54:26.000,23.99,Mike,MikeHillyer,Citrus Heights,United States,1,Below Avg,USA
16040,VOYAGE LEGALLY,0.99,VOYAGE LEGALLY,DENISE KELLY,2005-08-23 22:26:47.000,2005-08-27 18:02:47.000,28.99,Jon,JonStephens,Rio Claro,Brazil,2,Below Avg,Other
16041,ILLUSION AMELIE,0.99,ILLUSION AMELIE,GRACE ELLIS,2005-08-23 22:42:48.000,2005-08-25 02:48:48.000,15.99,Jon,JonStephens,Duisburg,Germany,2,Below Avg,Other
16042,HUNCHBACK IMPOSSIBLE,8.99,HUNCHBACK IMPOSSIBLE,GLADYS HAMILTON,2005-08-23 22:43:07.000,2005-08-31 21:33:07.000,28.99,Mike,MikeHillyer,Ilorin,Nigeria,1,Above Avg,Other
16043,MOB DUFFEL,3.99,MOB DUFFEL,PHILIP CAUSEY,2005-08-23 22:50:12.000,2005-08-30 01:01:12.000,25.99,Jon,JonStephens,Korolev,Russian Federation,2,Below Avg,Other

In [238]:
# save as csv
df.to_csv('challenge2_df.csv', index = False)

In [211]:
# actors and film info
df2 = pd.read_sql_query('''select actor.first_name || " " || actor.last_name as actor_name, film.title , category.name,
"language".name, film.rating ,film.rental_rate, film.rental_duration 
from film
left join film_actor on film_actor.film_id = film.film_id 
left join actor on actor.actor_id = film_actor.actor_id
left join film_category on film_category.film_id = film.film_id
left join category on category.category_id = film_category.category_id 
left join "language" on "language".language_id = film.language_id''', con)
df2

,actor_name,title,name,name,rating,rental_rate,rental_duration
0,PENELOPE GUINESS,ACADEMY DINOSAUR,Documentary,English,PG,0.99,6
1,CHRISTIAN GABLE,ACADEMY DINOSAUR,Documentary,English,PG,0.99,6
2,LUCILLE TRACY,ACADEMY DINOSAUR,Documentary,English,PG,0.99,6
3,SANDRA PECK,ACADEMY DINOSAUR,Documentary,English,PG,0.99,6
4,JOHNNY CAGE,ACADEMY DINOSAUR,Documentary,English,PG,0.99,6
...,...,...,...,...,...,...,...
5460,WHOOPI HURT,ZOOLANDER FICTION,Children,English,R,2.99,5
5461,JADA RYDER,ZOOLANDER FICTION,Children,English,R,2.99,5
5462,IAN TANDY,ZORRO ARK,Comedy,English,NC-17,4.99,3
5463,NICK DEGENERES,ZORRO ARK,Comedy,English,NC-17,4.99,3
5464,LISA MONROE,ZORRO ARK,Comedy,English,NC-17,4.99,3

In [212]:
# close connection
con.close()

In [213]:
df2.duplicated().sum()

0

In [214]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5465 entries, 0 to 5464
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   actor_name       5462 non-null   object
 1   title            5465 non-null   object
 2   name             5465 non-null   object
 3   name             5465 non-null   object
 4   rating           5465 non-null   object
 5   rental_rate      5465 non-null   float64
 6   rental_duration  5465 non-null   int64
dtypes: float64(1), int64(1), object(5)
memory usage: 299.0+ KB

In [215]:
df2.isna().sum()

actor_name         3
title              0
name               0
name               0
rating             0
rental_rate        0
rental_duration    0
dtype: int64

In [216]:
df2.to_csv('challenge2_df2.csv', index = False)

In [222]:
df3 = pd.read_sql_query('''select film.title, country.country 
from rental
left join inventory on inventory.inventory_id  = rental.inventory_id 
left join film on film.film_id = inventory.film_id 
left join customer on customer.customer_id = rental.customer_id 
left join payment on payment.rental_id = rental.rental_id  
left join staff on staff.staff_id = rental.staff_id   
left join address on address.address_id = customer.address_id 
left join store on store.manager_staff_id = staff.staff_id 
left join city on city.city_id = address.city_id 
left join country on country.country_id = city.country_id''',con)
df3

                      title             country
0           BLANKET BEVERLY              Brazil
1              FREAKY POCUS                Iran
2             GRADUATE LORD           Sri Lanka
3             LOVE SUICIDES          Azerbaijan
4           IDOLS SNATCHERS  Russian Federation
...                     ...                 ...
16039     COMANCHEROS ENEMY       United States
16040        VOYAGE LEGALLY              Brazil
16041       ILLUSION AMELIE             Germany
16042  HUNCHBACK IMPOSSIBLE             Nigeria
16043            MOB DUFFEL  Russian Federation

[16044 rows x 2 columns]

In [223]:
df3.to_csv('challenge2_df3.csv', index = False)

In [221]:
 group = df3.groupby(['country'])['title'].count()
group.to_frame()
group.head(50)

country
Afghanistan                                18
Algeria                                    90
American Samoa                             20
Angola                                     52
Anguilla                                   35
Argentina                                 352
Armenia                                    25
Austria                                    78
Azerbaijan                                 57
Bahrain                                    25
Bangladesh                                 95
Belarus                                    66
Bolivia                                    47
Brazil                                    748
Brunei                                     35
Bulgaria                                   50
Cambodia                                   53
Cameroon                                   54
Canada                                    137
Chad                                       32
Chile                                      71
China                                    1426
Colombia                                  159
Congo, The Democratic Republic of the      50
Czech Republic                             29
Dominican Republic                         77
Ecuador                                    87
Egypt                                     161
Estonia                                    30
Ethiopia                                   23
Faroe Islands                              28
Finland                                    26
France                                     96
French Guiana                              22
French Polynesia                           54
Gambia                                     30
Germany                                   196
Greece                                     54
Greenland                                  34
Holy See (Vatican City State)              34
Hong Kong                                  30
Hungary                                    29
India                                    1572
Indonesia                                 367
Iran                                      225
Iraq                                       27
Israel                                     99
Italy                                     189
Japan                                     825
Kazakstan                                  52
Name: title, dtype: int64